//====================================================================================================================
//====================================================================================================================
// tower.assets.js
// client에서 Tower 종류별 SO 데이터
//====================================================================================================================
//====================================================================================================================

export const towerAssets = {
    TOW00001: {
        power: 40,
        powerPerLv: 10,
        range: 300,
        cooldown: 180,
        duration: 30,
        cost: 3000,
        extra: 1,
        extraPerLv: 0.5,
    },
    TOW00002: {
        power: 60,
        powerPerLv: 15,
        range: 400,
        cooldown: 300,
        duration: 0,
        cost: 3000,
        extra: 100,
        extraPerLv: 0,
    },
    TOW00003: {
        power: 20,
        powerPerLv: 5,
        range: 200,
        cooldown: 60,
        duration: 0,
        cost: 300,
        extra: 3,
        extraPerLv: 1,
    },
    TOW00004: {
        power: 10,
        powerPerLv: 5,
        range: 300,
        cooldown: 120,
        duration: 0,
        cost: 3000,
        extra: 10,
        extraPerLv: 1,
    }
};
